//==========================================================================
// 
//  練習敵(攻撃)処理 [enemy_practice_attack.cpp]
//  Author : 相馬靜雅
// 
//==========================================================================
#include "enemy_practice_attack.h"

//==========================================================================
// コンストラクタ
//==========================================================================
CEnemyPractice_Attack::CEnemyPractice_Attack(int nPriority) : CEnemyPractice(nPriority)
{

}

//==========================================================================
// デストラクタ
//==========================================================================
CEnemyPractice_Attack::~CEnemyPractice_Attack()
{

}

//==========================================================================
// 初期化処理
//==========================================================================
HRESULT CEnemyPractice_Attack::Init()
{
	//初期化処理
	CEnemyPractice::Init();
	
	m_pAtkPattern.push_back(DEBUG_NEW CAttack_PracticeNormalAttack());	// 通常攻撃

	// 攻撃切り替え
	ChangeATKState(m_pAtkPattern[0]);

	return S_OK;
}
