//==========================================================================
// 
//  練習敵(攻撃)処理 [enemy_practice_SA.cpp]
//  Author : 相馬靜雅
// 
//==========================================================================
#include "enemy_practice_SA.h"

//==========================================================================
// コンストラクタ
//==========================================================================
CEnemyPractice_SA::CEnemyPractice_SA(int nPriority) : CEnemyPractice(nPriority)
{

}

//==========================================================================
// デストラクタ
//==========================================================================
CEnemyPractice_SA::~CEnemyPractice_SA()
{

}

//==========================================================================
// 初期化処理
//==========================================================================
HRESULT CEnemyPractice_SA::Init()
{
	//初期化処理
	CEnemyPractice::Init();

	m_pAtkPattern.push_back(DEBUG_NEW CAttack_PracticeStrongAttack());	// 強攻撃

	// 攻撃切り替え
	ChangeATKState(m_pAtkPattern[0]);

	return S_OK;
}
