//=============================================================================
// 
//  チュートリアルヘッダー [game_tutorial.h]
//  Author : 相馬靜雅
// 
//=============================================================================

#ifndef _GAME_TUTORIAL_H_
#define _GAME_TUTORIAL_H_	// 二重インクルード防止

#include "game.h"

//==========================================================================
// 前方宣言
//==========================================================================

//==========================================================================
// クラス定義
//==========================================================================
// ゲームクラス定義
class CGameTutorial : public CGame
{
public:

	CGameTutorial();
	~CGameTutorial();

	// オーバーライドされた関数
	HRESULT Init() override;
	void Uninit() override;
	void Update() override;
	void Draw() override;


private:

	virtual void InitByMode() override;	// モード別初期化

	//=============================
	// メンバ関数
	//=============================

	//=============================
	// メンバ変数
	//=============================
};



#endif