//==========================================================================
// 
//  チュートリアル時ポーズ処理 [pause_tutorial.cpp]
//  Author : 相馬靜雅
// 
//==========================================================================
#include "pause_tutorial.h"
#include "manager.h"
#include "fade.h"

//==========================================================================
// 定数定義
//==========================================================================
namespace
{
	const char* TEXTURE = "data\\TEXTURE\\pause\\tutorialend.png";	// テクスチャファイル
}

//==========================================================================
// コンストラクタ
//==========================================================================
CPause_Tutorial::CPause_Tutorial()
{

}

//==========================================================================
// デストラクタ
//==========================================================================
CPause_Tutorial::~CPause_Tutorial()
{

}

//==========================================================================
// 初期化処理
//==========================================================================
HRESULT CPause_Tutorial::Init()
{
	// 初期化処理
	CPause::Init();

	// テクスチャ切り替え
	int nTexIdx = CTexture::GetInstance()->Regist(TEXTURE);
	m_aObject2D[VTX::VTX_RETRY]->BindTexture(nTexIdx);

	return S_OK;
}

//==========================================================================
// モード別決定処理
//==========================================================================
void CPause_Tutorial::DecideByMode()
{
	// サウンド再生
	//CManager::GetInstance()->GetSound()->PlaySound(CSound::LABEL_SE_DONE);

	// ゲームへ
	CManager::GetInstance()->GetFade()->SetFade(CScene::MODE_GAME);
}
