//==========================================================================
// 
//  ゲーム時ポーズ処理 [pause_game.cpp]
//  Author : 相馬靜雅
// 
//==========================================================================
#include "pause_game.h"
#include "manager.h"
#include "fade.h"

//==========================================================================
// 定数定義
//==========================================================================
namespace
{
	const char* TEXTURE = "data\\TEXTURE\\pause\\retry.png";	// テクスチャファイル
}

//==========================================================================
// コンストラクタ
//==========================================================================
CPause_Game::CPause_Game()
{

}

//==========================================================================
// デストラクタ
//==========================================================================
CPause_Game::~CPause_Game()
{

}

//==========================================================================
// 初期化処理
//==========================================================================
HRESULT CPause_Game::Init()
{
	// 初期化処理
	CPause::Init();

	// テクスチャ切り替え
	int nTexIdx = CTexture::GetInstance()->Regist(TEXTURE);
	m_aObject2D[VTX::VTX_RETRY]->BindTexture(nTexIdx);

	return S_OK;
}

//==========================================================================
// モード別決定処理
//==========================================================================
void CPause_Game::DecideByMode()
{
	// サウンド再生
	//CManager::GetInstance()->GetSound()->PlaySound(CSound::LABEL_SE_DONE);

	// ゲームをリトライする
	CManager::GetInstance()->GetFade()->SetFade(CScene::MODE_GAME);
}
